Revit 2027 API
FabricationConfiguration.GetAllMaterials Method
 Gets all material identifiers in the fabrication configuration.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<int> GetAllMaterials(
	FabricationPart part
)
Public Function GetAllMaterials (
	part As FabricationPart
) As IList(Of Integer)
public:
IList<int>^ GetAllMaterials(
	FabricationPart^ part
)
member GetAllMaterials :
        part : FabricationPart -> IList<int>
Parameters
part FabricationPart
 The fabrication part.
Return Value
IList<Int32>
 An array of material identifiers.
Remarks
 If a part is passed, only returns materials which are valid for the part, otherwise returns all materials.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace